Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCcu6_bf.h
/** \brief Offset for Ifx_CCU6_T13_Bits.T13CV */
#define IFX_CCU6_T13_T13CV_OFF (0u)

/** \brief Length for Ifx_CCU6_T13PR_Bits.T13PV */
#define IFX_CCU6_T13PR_T13PV_LEN (16u)

/** \brief Mask for Ifx_CCU6_T13PR_Bits.T13PV */
#define IFX_CCU6_T13PR_T13PV_MSK (0xffffu)

/** \brief Offset for Ifx_CCU6_T13PR_Bits.T13PV */
#define IFX_CCU6_T13PR_T13PV_OFF (0u)

/** \brief Length for Ifx_CCU6_CC63R_Bits.CCV */
#define IFX_CCU6_CC63R_CCV_LEN (16u)

/** \brief Mask for Ifx_CCU6_CC63R_Bits.CCV */
#define IFX_CCU6_CC63R_CCV_MSK (0xffffu)

/** \brief Offset for Ifx_CCU6_CC63R_Bits.CCV */
#define IFX_CCU6_CC63R_CCV_OFF (0u)

/** \brief Length for Ifx_CCU6_CC63SR_Bits.CCS */
#define IFX_CCU6_CC63SR_CCS_LEN (16u)

/** \brief Mask for Ifx_CCU6_CC63SR_Bits.CCS */
#define IFX_CCU6_CC63SR_CCS_MSK (0xffffu)

/** \brief Offset for Ifx_CCU6_CC63SR_Bits.CCS */
#define IFX_CCU6_CC63SR_CCS_OFF (0u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC6ST0 */
#define IFX_CCU6_CMPSTAT_CC6ST0_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC6ST0 */
#define IFX_CCU6_CMPSTAT_CC6ST0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC6ST0 */
#define IFX_CCU6_CMPSTAT_CC6ST0_OFF (0u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC6ST1 */
#define IFX_CCU6_CMPSTAT_CC6ST1_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC6ST1 */
#define IFX_CCU6_CMPSTAT_CC6ST1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC6ST1 */
#define IFX_CCU6_CMPSTAT_CC6ST1_OFF (1u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC6ST2 */
#define IFX_CCU6_CMPSTAT_CC6ST2_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC6ST2 */
#define IFX_CCU6_CMPSTAT_CC6ST2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC6ST2 */
#define IFX_CCU6_CMPSTAT_CC6ST2_OFF (2u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CCPOS60 */
#define IFX_CCU6_CMPSTAT_CCPOS60_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CCPOS60 */
#define IFX_CCU6_CMPSTAT_CCPOS60_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CCPOS60 */
#define IFX_CCU6_CMPSTAT_CCPOS60_OFF (3u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CCPOS61 */
#define IFX_CCU6_CMPSTAT_CCPOS61_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CCPOS61 */
#define IFX_CCU6_CMPSTAT_CCPOS61_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CCPOS61 */
#define IFX_CCU6_CMPSTAT_CCPOS61_OFF (4u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CCPOS62 */
#define IFX_CCU6_CMPSTAT_CCPOS62_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CCPOS62 */
#define IFX_CCU6_CMPSTAT_CCPOS62_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CCPOS62 */
#define IFX_CCU6_CMPSTAT_CCPOS62_OFF (5u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC63ST */
#define IFX_CCU6_CMPSTAT_CC63ST_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC63ST */
#define IFX_CCU6_CMPSTAT_CC63ST_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC63ST */
#define IFX_CCU6_CMPSTAT_CC63ST_OFF (6u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC6PS0 */
#define IFX_CCU6_CMPSTAT_CC6PS0_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC6PS0 */
#define IFX_CCU6_CMPSTAT_CC6PS0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC6PS0 */
#define IFX_CCU6_CMPSTAT_CC6PS0_OFF (8u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.COUT6PS0 */
#define IFX_CCU6_CMPSTAT_COUT6PS0_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.COUT6PS0 */
#define IFX_CCU6_CMPSTAT_COUT6PS0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.COUT6PS0 */
#define IFX_CCU6_CMPSTAT_COUT6PS0_OFF (9u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC6PS1 */
#define IFX_CCU6_CMPSTAT_CC6PS1_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC6PS1 */
#define IFX_CCU6_CMPSTAT_CC6PS1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC6PS1 */
#define IFX_CCU6_CMPSTAT_CC6PS1_OFF (10u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.COUT6PS1 */
#define IFX_CCU6_CMPSTAT_COUT6PS1_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.COUT6PS1 */
#define IFX_CCU6_CMPSTAT_COUT6PS1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.COUT6PS1 */
#define IFX_CCU6_CMPSTAT_COUT6PS1_OFF (11u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.CC6PS2 */
#define IFX_CCU6_CMPSTAT_CC6PS2_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.CC6PS2 */
#define IFX_CCU6_CMPSTAT_CC6PS2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.CC6PS2 */
#define IFX_CCU6_CMPSTAT_CC6PS2_OFF (12u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.COUT6PS2 */
#define IFX_CCU6_CMPSTAT_COUT6PS2_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.COUT6PS2 */
#define IFX_CCU6_CMPSTAT_COUT6PS2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.COUT6PS2 */
#define IFX_CCU6_CMPSTAT_COUT6PS2_OFF (13u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.COUT63PS */
#define IFX_CCU6_CMPSTAT_COUT63PS_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.COUT63PS */
#define IFX_CCU6_CMPSTAT_COUT63PS_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.COUT63PS */
#define IFX_CCU6_CMPSTAT_COUT63PS_OFF (14u)

/** \brief Length for Ifx_CCU6_CMPSTAT_Bits.T13IM */
#define IFX_CCU6_CMPSTAT_T13IM_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPSTAT_Bits.T13IM */
#define IFX_CCU6_CMPSTAT_T13IM_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPSTAT_Bits.T13IM */
#define IFX_CCU6_CMPSTAT_T13IM_OFF (15u)

/** \brief Length for Ifx_CCU6_CMPMODIF_Bits.MCC6S0 */
#define IFX_CCU6_CMPMODIF_MCC6S0_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPMODIF_Bits.MCC6S0 */
#define IFX_CCU6_CMPMODIF_MCC6S0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPMODIF_Bits.MCC6S0 */
#define IFX_CCU6_CMPMODIF_MCC6S0_OFF (0u)

/** \brief Length for Ifx_CCU6_CMPMODIF_Bits.MCC6S1 */
#define IFX_CCU6_CMPMODIF_MCC6S1_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPMODIF_Bits.MCC6S1 */
#define IFX_CCU6_CMPMODIF_MCC6S1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPMODIF_Bits.MCC6S1 */
#define IFX_CCU6_CMPMODIF_MCC6S1_OFF (1u)

/** \brief Length for Ifx_CCU6_CMPMODIF_Bits.MCC6S2 */
#define IFX_CCU6_CMPMODIF_MCC6S2_LEN (1u)

/** \brief Mask for Ifx_CCU6_CMPMODIF_Bits.MCC6S2 */
#define IFX_CCU6_CMPMODIF_MCC6S2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_CMPMODIF_Bits.MCC6S2 */
#define IFX_CCU6_CMPMODIF_MCC6S2_OFF (2u)

