Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCcu6_bf.h
/** \brief Mask for Ifx_CCU6_IMON_Bits.CCPOSI1 */
#define IFX_CCU6_IMON_CCPOSI1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.CCPOSI1 */
#define IFX_CCU6_IMON_CCPOSI1_OFF (2u)

/** \brief Length for Ifx_CCU6_IMON_Bits.CCPOSI2 */
#define IFX_CCU6_IMON_CCPOSI2_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.CCPOSI2 */
#define IFX_CCU6_IMON_CCPOSI2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.CCPOSI2 */
#define IFX_CCU6_IMON_CCPOSI2_OFF (3u)

/** \brief Length for Ifx_CCU6_IMON_Bits.CC6INI0 */
#define IFX_CCU6_IMON_CC6INI0_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.CC6INI0 */
#define IFX_CCU6_IMON_CC6INI0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.CC6INI0 */
#define IFX_CCU6_IMON_CC6INI0_OFF (4u)

/** \brief Length for Ifx_CCU6_IMON_Bits.CC6INI1 */
#define IFX_CCU6_IMON_CC6INI1_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.CC6INI1 */
#define IFX_CCU6_IMON_CC6INI1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.CC6INI1 */
#define IFX_CCU6_IMON_CC6INI1_OFF (5u)

/** \brief Length for Ifx_CCU6_IMON_Bits.CC6INI2 */
#define IFX_CCU6_IMON_CC6INI2_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.CC6INI2 */
#define IFX_CCU6_IMON_CC6INI2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.CC6INI2 */
#define IFX_CCU6_IMON_CC6INI2_OFF (6u)

/** \brief Length for Ifx_CCU6_IMON_Bits.CTRAPI */
#define IFX_CCU6_IMON_CTRAPI_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.CTRAPI */
#define IFX_CCU6_IMON_CTRAPI_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.CTRAPI */
#define IFX_CCU6_IMON_CTRAPI_OFF (7u)

/** \brief Length for Ifx_CCU6_IMON_Bits.T12HRI */
#define IFX_CCU6_IMON_T12HRI_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.T12HRI */
#define IFX_CCU6_IMON_T12HRI_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.T12HRI */
#define IFX_CCU6_IMON_T12HRI_OFF (8u)

/** \brief Length for Ifx_CCU6_IMON_Bits.T13HRI */
#define IFX_CCU6_IMON_T13HRI_LEN (1u)

/** \brief Mask for Ifx_CCU6_IMON_Bits.T13HRI */
#define IFX_CCU6_IMON_T13HRI_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IMON_Bits.T13HRI */
#define IFX_CCU6_IMON_T13HRI_OFF (9u)

/** \brief Length for Ifx_CCU6_LI_Bits.CCPOSEN0 */
#define IFX_CCU6_LI_CCPOSEN0_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CCPOSEN0 */
#define IFX_CCU6_LI_CCPOSEN0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CCPOSEN0 */
#define IFX_CCU6_LI_CCPOSEN0_OFF (1u)

/** \brief Length for Ifx_CCU6_LI_Bits.CCPOSEN1 */
#define IFX_CCU6_LI_CCPOSEN1_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CCPOSEN1 */
#define IFX_CCU6_LI_CCPOSEN1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CCPOSEN1 */
#define IFX_CCU6_LI_CCPOSEN1_OFF (2u)

/** \brief Length for Ifx_CCU6_LI_Bits.CCPOSEN2 */
#define IFX_CCU6_LI_CCPOSEN2_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CCPOSEN2 */
#define IFX_CCU6_LI_CCPOSEN2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CCPOSEN2 */
#define IFX_CCU6_LI_CCPOSEN2_OFF (3u)

/** \brief Length for Ifx_CCU6_LI_Bits.CC6INEN0 */
#define IFX_CCU6_LI_CC6INEN0_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CC6INEN0 */
#define IFX_CCU6_LI_CC6INEN0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CC6INEN0 */
#define IFX_CCU6_LI_CC6INEN0_OFF (4u)

/** \brief Length for Ifx_CCU6_LI_Bits.CC6INEN1 */
#define IFX_CCU6_LI_CC6INEN1_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CC6INEN1 */
#define IFX_CCU6_LI_CC6INEN1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CC6INEN1 */
#define IFX_CCU6_LI_CC6INEN1_OFF (5u)

/** \brief Length for Ifx_CCU6_LI_Bits.CC6INEN2 */
#define IFX_CCU6_LI_CC6INEN2_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CC6INEN2 */
#define IFX_CCU6_LI_CC6INEN2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CC6INEN2 */
#define IFX_CCU6_LI_CC6INEN2_OFF (6u)

/** \brief Length for Ifx_CCU6_LI_Bits.CTRAPEN */
#define IFX_CCU6_LI_CTRAPEN_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.CTRAPEN */
#define IFX_CCU6_LI_CTRAPEN_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.CTRAPEN */
#define IFX_CCU6_LI_CTRAPEN_OFF (7u)

/** \brief Length for Ifx_CCU6_LI_Bits.T12HREN */
#define IFX_CCU6_LI_T12HREN_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.T12HREN */
#define IFX_CCU6_LI_T12HREN_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.T12HREN */
#define IFX_CCU6_LI_T12HREN_OFF (8u)

/** \brief Length for Ifx_CCU6_LI_Bits.T13HREN */
#define IFX_CCU6_LI_T13HREN_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.T13HREN */
#define IFX_CCU6_LI_T13HREN_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.T13HREN */
#define IFX_CCU6_LI_T13HREN_OFF (9u)

/** \brief Length for Ifx_CCU6_LI_Bits.LBEEN */
#define IFX_CCU6_LI_LBEEN_LEN (1u)

/** \brief Mask for Ifx_CCU6_LI_Bits.LBEEN */
#define IFX_CCU6_LI_LBEEN_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_LI_Bits.LBEEN */
#define IFX_CCU6_LI_LBEEN_OFF (13u)

/** \brief Length for Ifx_CCU6_LI_Bits.INPLBE */
#define IFX_CCU6_LI_INPLBE_LEN (2u)

/** \brief Mask for Ifx_CCU6_LI_Bits.INPLBE */
#define IFX_CCU6_LI_INPLBE_MSK (0x3u)

/** \brief Offset for Ifx_CCU6_LI_Bits.INPLBE */
#define IFX_CCU6_LI_INPLBE_OFF (14u)

/** \brief Length for Ifx_CCU6_IS_Bits.ICC60R */
#define IFX_CCU6_IS_ICC60R_LEN (1u)

/** \brief Mask for Ifx_CCU6_IS_Bits.ICC60R */
#define IFX_CCU6_IS_ICC60R_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IS_Bits.ICC60R */
#define IFX_CCU6_IS_ICC60R_OFF (0u)

/** \brief Length for Ifx_CCU6_IS_Bits.ICC60F */
#define IFX_CCU6_IS_ICC60F_LEN (1u)

/** \brief Mask for Ifx_CCU6_IS_Bits.ICC60F */
#define IFX_CCU6_IS_ICC60F_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IS_Bits.ICC60F */
#define IFX_CCU6_IS_ICC60F_OFF (1u)

/** \brief Length for Ifx_CCU6_IS_Bits.ICC61R */
#define IFX_CCU6_IS_ICC61R_LEN (1u)

/** \brief Mask for Ifx_CCU6_IS_Bits.ICC61R */
#define IFX_CCU6_IS_ICC61R_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IS_Bits.ICC61R */
#define IFX_CCU6_IS_ICC61R_OFF (2u)

/** \brief Length for Ifx_CCU6_IS_Bits.ICC61F */
#define IFX_CCU6_IS_ICC61F_LEN (1u)

/** \brief Mask for Ifx_CCU6_IS_Bits.ICC61F */
#define IFX_CCU6_IS_ICC61F_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IS_Bits.ICC61F */
#define IFX_CCU6_IS_ICC61F_OFF (3u)

